OpenFOAM-dev/tutorials/multicomponentFluid/aachenBomb/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      N2;
}
// ************************************************************************* //

dimensions          [];

internalField       uniform 0.766;

boundaryField
{
    walls
    {
        type                zeroGradient;
    }
}

// ************************************************************************* //
