OpenFOAM-dev/tutorials/multicomponentFluid/aachenBomb/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    pcorr
    {
        solver          GAMG;
        smoother        GaussSeidel;

        tolerance       1e-3;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        smoother        GaussSeidel;

        tolerance       1e-6;
        relTol          0.1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    "(h|Yi|O2|N2|H2O)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-6;
        relTol          0.1;
    }

    "(h|Yi|O2|N2|H2O)Final"
    {
        $Yi;
        relTol          0;
    }
}

PIMPLE
{
    transonic       no;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
}

relaxationFactors
{
    equations
    {
        ".*"        1;
    }
}

// ************************************************************************* //
